#!/usr/bin/env bash

# Должна быть проверка на то, что такой сигнал вообще существует (невалидные номера отбрасывают)
# kill -n <signal> <pid>. pid - shell-скрипта
# Cкрипт выводит строку о том, что: 
#   - это он вывел строку.
#   - номер и имя сигнала, который мы поймали.


# Функция для обработки сигналов
# 17 сигнал добавлен в искл., чтобы не спамить в консоль. Он отправляется родительскому процессу, 
# когда один из дочерних процессов завершает выполнение. 
# Это происходит во время каждого вызова sleep.
sig_handler() {
    if [ $1 != 17 ]; then
    NAME=$(kill -l $1)
    echo "Caught signal $1 (SIG$NAME)"
    # можно оставить exit 1, если хотим, чтобы после получения сигнала процесс завершался
    # exit 1
    fi
}

# определяем сигналы, которые будем обрабатывать
# структура trap: trap <действие> <сигнлал1 сигнлал2 и тд>
# поэтому будет действие, если получили сигнал 1-31 
# {X..Y} - последовательность
for SIGNAL in {1..31}; do
    # Установка обработчиков сигналов
    trap "sig_handler $SIGNAL" "$SIGNAL"
done


while true; do
    echo "Script is running..."
    sleep 1
done
